<?php

			$imgListData=array 
				( 
					    array 
					    ( 
					              "id" =>"1",
							      "name" => "月饼",
							      "imgUrl" => "/image/food1.jpg",
							      "desc" => "月饼是久负盛名的中国传统糕点之一，中秋节节日食俗。月饼圆又圆，又是合家分吃，象征着团圆和睦。古代月饼被作为祭品于中秋节所食。据说中秋节吃月饼的习俗始于唐朝。北宋之时在宫廷内流行，后流传到民间，当时俗称“小饼”和“月团”。发展至明朝则成为全民共同的饮食习俗。月饼与各地饮食习俗相融合，又发展出广式、京式、苏式、潮式、滇式等月饼，被中国南北各地的人们所喜爱。"
					    ),
					    array 
					    ( 
					              "id" => "2",
							      "name" => "粽子",
							      "imgUrl" => "/image/food2.jpg",
							      "desc" => "粽子，即粽籺，是籺的一种，又称“角黍”、“筒粽”，由粽叶包裹糯米蒸制而成，是中华民族传统节庆食物之一。粽子早在春秋之前就已出现，最初是用来祭祀祖先和神灵。到了晋代，粽子成为端午节庆食物。 食粽子的风俗，千百年来，在中国盛行不衰，而且流传到朝鲜、日本及东南亚诸国。"
						),
						array 
					    ( 
					              "id" => "3",
							      "name" => "饺子",
							      "imgUrl" => "/image/food3.jpg",
							      "desc" => "饺子源于古代的角子。饺子原名“娇耳”，是我国南阳人医圣张仲景首先发明的，距今已有一千八百多年的历史了。是深受中国人民喜爱的传统特色食品，又称水饺，是中国北方民间的主食和地方小吃，也是年节食品。有一句民谣叫“大寒小寒，吃饺子过年。”饺子多用面皮包馅水煮而成。"
						),
						array 
					    ( 
					              "id" => "4",
							      "name" => "汤圆",
							      "imgUrl" => "/image/food4.jpg",
							      "desc" => "汤圆，是中国传统小吃的代表之一，是由糯米粉等做的球状食品。一般有馅料，煮熟带汤食用。同时也是元宵节最具有特色的食物，历史十分悠久。据传，汤圆起源于宋朝。当时明州（现浙江省宁波市）兴起吃一种新奇食品，即用黑芝麻、猪油做馅、加入少许白砂糖，外面用糯米粉搓成圆形，煮熟后，吃起来香甜可口，饶有风趣。因为这种糯米汤圆煮在锅里又浮又沉，所以它最早叫“浮元子”，后来有的地区把“浮元子”改称汤团。然而，汤团象征合家团圆更美好，吃汤圆意味新的一年合家幸福、团团圆圆，所以是正月十五元宵节必备美食。而在南方某些地区，人们在春节的时候也会习惯吃汤圆，而不是饺子。"
						)
				);

				$name=$_GET['name'];

				foreach ($imgListData as $key => $value) {
						if($imgListData[$key]['name']==$name){
								$data[]=$imgListData[$key];
								break;
						}else{
							$data="";
						}
				}
				
				
				echo(json_encode($data,JSON_UNESCAPED_SLASHES|JSON_UNESCAPED_UNICODE));

